# Pandas Kütüphanesi

Pandas, veri manipülasyonu ve analizi için kullanılan açık kaynaklı bir Python kütüphanesidir. Yapılandırılmış verilerle hızlı ve kolay çalışmak için veri yapıları ve işlevler sağlar.

Pandas'taki iki ana veri yapısı Seri ve DataFrame'dir. Seri, herhangi bir veri türünü içerebilen tek boyutlu bir dizi benzeri nesnedir. DataFrame ise bir elektronik tabloya benzer şekilde, satırlar ve sütunlardan oluşan iki boyutlu bir tablo benzeri veri yapısıdır.

In [57]:
t = (1,2,3,4)

t[1:3]

(2, 3)

In [58]:

import pandas as pd
#Sözlük Yapısını DataFrame haline dönüştürmek mümkündür.

dictionary = {"name":["ali","veli","zübeyde","ahmet","kubra","can"],
             "age":[12,34,56,78,None,12],
             "note":[123,456,78,87654,None,89]}

dataframe1 = pd.DataFrame(dictionary) 
print(dataframe1)

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN
5      can  12.0     89.0

In [59]:
import pandas as pd
#Dosya ile aynı klasörde bulunan iris verisetini okuttuk.

df = pd.read_csv("iris.csv")

print(df)

     sepal_length  sepal_width  petal_length  petal_width         species
0             5.1          3.5           1.4          0.2     Iris-setosa
1             4.9          3.0           1.4          0.2     Iris-setosa
2             4.7          3.2           1.3          0.2     Iris-setosa
3             4.6          3.1           1.5          0.2     Iris-setosa
4             5.0          3.6           1.4          0.2     Iris-setosa
..            ...          ...           ...          ...             ...
145           6.7          3.0           5.2          2.3  Iris-virginica
146           6.3          2.5           5.0          1.9  Iris-virginica
147           6.5          3.0           5.2          2.0  Iris-virginica
148           6.2          3.4           5.4          2.3  Iris-virginica
149           5.9          3.0           5.1          1.8  Iris-virginica

[150 rows x 5 columns]

In [60]:
#Veri setimizin ilk beş satırını görebilmek için head() methodu kullanılır.

head = dataframe1.head() 
print(head)

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN

In [61]:
##Veri setimizin son beş satırını görebilmek için tail() methodu kullanılır.

tail = dataframe1.tail()
print(tail)

      name   age     note
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
4    kubra   NaN      NaN
5      can  12.0     89.0

# Pandas'ın Methodları

In [62]:
import numpy as np
obje=pd.Series(np.arange(5),index=["a","b","c","d","e"])

In [63]:
obje

a    0
b    1
c    2
d    3
e    4
dtype: int32

In [64]:
obje["c"]

2

In [65]:
obje[2]

2

In [66]:
#Veriyi dilimlemek istersek


obje[0:3]

a    0
b    1
c    2
dtype: int32

In [67]:
#Belirli satırları almak istersek

obje[["a","c"]]

a    0
c    2
dtype: int32

In [68]:
obje[[0,2]]

a    0
c    2
dtype: int32

In [69]:
#İkiden küçük değerleri ekrana yazdırmak için

obje[obje<2]

a    0
b    1
dtype: int32

In [70]:
#Etiket dilimlemesi normal Python dilimlemesinden farklıdır. Etiket dilimlemesinde son nokta dilimlemeye dahildir.

obje["a":"d"]

a    0
b    1
c    2
d    3
dtype: int32

In [71]:
#Dilimlenen kısıma değer ataması yapabiliriz.

obje["a":"d"]=0
obje

a    0
b    0
c    0
d    0
e    4
dtype: int32

# DataFrame İçin Veri Dilimleme

In [72]:
data=pd.DataFrame(np.arange(16).reshape(4,4),index=["Bursa","Ankara","Rize","İstanbul"],
                 columns=["bir","iki","üç","dört"])

In [73]:
data

          bir  iki  üç  dört
Bursa       0    1   2     3
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [74]:
data["iki"]

Bursa        1
Ankara       5
Rize         9
İstanbul    13
Name: iki, dtype: int32

In [75]:
data[["bir","iki"]]

          bir  iki
Bursa       0    1
Ankara      4    5
Rize        8    9
İstanbul   12   13

In [76]:
data[:3]

        bir  iki  üç  dört
Bursa     0    1   2     3
Ankara    4    5   6     7
Rize      8    9  10    11

In [77]:
data[data["dört"]>5]

          bir  iki  üç  dört
Ankara      4    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [78]:
data[data<5]=0

In [79]:
data

          bir  iki  üç  dört
Bursa       0    0   0     0
Ankara      0    5   6     7
Rize        8    9  10    11
İstanbul   12   13  14    15

In [80]:
#Satırlarla ilgili işlemler için loc ve iloc operatörleri kullanılabilir.İloc girilen indexin satır değerlerini döndürür.

data.iloc[1]

bir     0
iki     5
üç      6
dört    7
Name: Ankara, dtype: int32

In [81]:
#Belli bir satırın belli değerlerini almak hatta belli satırların belli değerlerini de almak mümkündür.

data.iloc[1,[1,2,3]]

iki     5
üç      6
dört    7
Name: Ankara, dtype: int32

In [82]:
data.iloc[[1,3],[1,2,3]]

          iki  üç  dört
Ankara      5   6     7
İstanbul   13  14    15

In [83]:
data.loc["Rize",["bir","iki"]]

bir    8
iki    9
Name: Rize, dtype: int32

In [84]:
data.loc[:"Rize","dört"]

Bursa      0
Ankara     7
Rize      11
Name: dört, dtype: int32

In [85]:
print(dataframe1.columns) # sutunlarin isimlerini verir

Index(['name', 'age', 'note'], dtype='object')

In [86]:
print(dataframe1.info()) #dataframe hakkında bilgi verir

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    6 non-null      object
 1   age     5 non-null      float64
 2   note    5 non-null      float64
dtypes: float64(2), object(1)
memory usage: 272.0+ bytes
None

In [87]:
#Describe() methodu bize veri seti hakkında bilgiler verir.
df.describe()

       sepal_length  sepal_width  petal_length  petal_width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.054000      3.758667     1.198667
std        0.828066     0.433594      1.764420     0.763161
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

# Indexleme ve Dilimleme

In [88]:
print(dataframe1["name"]) 
print(dataframe1.loc[:, "age"])                      #   sadece isimleri getirir
dataframe1["yeni_future"] = [1,2,3,4,5,6]
print(dataframe1.loc[:3,"age"]) 
print(dataframe1.loc[:3, "name":"note"])                 #name den note'a kadar olan kolonların ilk 3 satırını yazdırır
print(dataframe1.loc[::-1])                           #indexleri tersten yazdırdı

0        ali
1       veli
2    zübeyde
3      ahmet
4      kubra
5        can
Name: name, dtype: object
0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64
0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64
      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0
      name   age     note  yeni_future
5      can  12.0     89.0            6
4    kubra   NaN      NaN            5
3    ahmet  78.0  87654.0            4
2  zübeyde  56.0     78.0            3
1     veli  34.0    456.0            2
0      ali  12.0    123.0            1

In [89]:
 #yeni future tanımlandı
print(dataframe1.yeni_future)

0    1
1    2
2    3
3    4
4    5
5    6
Name: yeni_future, dtype: int64

In [90]:
print(dataframe1.loc[:, "age"]) # sutun getirmenin bir başka yolu

0    12.0
1    34.0
2    56.0
3    78.0
4     NaN
5    12.0
Name: age, dtype: float64

In [91]:
print(dataframe1.loc[:3,"age"])

0    12.0
1    34.0
2    56.0
3    78.0
Name: age, dtype: float64

In [92]:
print(dataframe1.loc[:3, "name":"note"]) #name den note'a kadar olan kolonların ilk 3 satırını yazdırdı 3 dahil

      name   age     note
0      ali  12.0    123.0
1     veli  34.0    456.0
2  zübeyde  56.0     78.0
3    ahmet  78.0  87654.0

In [93]:
print(dataframe1.loc[:3, ["name","note"]]) #sadece name ve notun 3. indeksine kadar yazdırır

      name     note
0      ali    123.0
1     veli    456.0
2  zübeyde     78.0
3    ahmet  87654.0

In [94]:
print(dataframe1.loc[::-1]) #indexleri tersten yazdırdı

      name   age     note  yeni_future
5      can  12.0     89.0            6
4    kubra   NaN      NaN            5
3    ahmet  78.0  87654.0            4
2  zübeyde  56.0     78.0            3
1     veli  34.0    456.0            2
0      ali  12.0    123.0            1

In [95]:
print(dataframe1.loc[:,:"age"]) #age kadar olan tüm satırları yazdırdı. age dahil

      name   age
0      ali  12.0
1     veli  34.0
2  zübeyde  56.0
3    ahmet  78.0
4    kubra   NaN
5      can  12.0

In [96]:
print(dataframe1.iloc[:,[2]]) #2. indeksdeki kolonun tüm satırlarını verir

      note
0    123.0
1    456.0
2     78.0
3  87654.0
4      NaN
5     89.0

## Filtering Pandas Data Frame

In [97]:
filtre1 = dataframe1.age>10                           #yaşı 10'dan büyük olanlar filtrelendi
dataframe1["bool"]= filtre1
print(dataframe1.loc[:,["age","bool"]])

    age   bool
0  12.0   True
1  34.0   True
2  56.0   True
3  78.0   True
4   NaN  False
5  12.0   True

In [98]:
type(filtre1) #nupmy'da vektör denilirken pandas'da ise tipine series deniliyor. Serilerin birleşimine ise dataframe denir.

pandas.core.series.Series

In [99]:
filtrelenmis_data= dataframe1[filtre1] #dataframe'i filtrelemiş olduk, sadece koşulu sağlayan indeksler yazıldı
print(filtrelenmis_data)

      name   age     note  yeni_future  bool
0      ali  12.0    123.0            1  True
1     veli  34.0    456.0            2  True
2  zübeyde  56.0     78.0            3  True
3    ahmet  78.0  87654.0            4  True
5      can  12.0     89.0            6  True

In [100]:
filtre2 = dataframe1.note>100
filtrelenmis_data2 = dataframe1[filtre2&filtre1] #iki filtre birden uyguladık
print(filtrelenmis_data2)

    name   age     note  yeni_future  bool
0    ali  12.0    123.0            1  True
1   veli  34.0    456.0            2  True
3  ahmet  78.0  87654.0            4  True

In [101]:
dataframe1[dataframe1.age>20] #bu şekildede filtreleme uygulayabiliriz

      name   age     note  yeni_future  bool
1     veli  34.0    456.0            2  True
2  zübeyde  56.0     78.0            3  True
3    ahmet  78.0  87654.0            4  True

# List Comprehension

In [102]:
import numpy as np
ortalama = dataframe1.note.mean() #pandas ile ortalama bulma 
print(ortalama)
ortlama_np= np.mean(dataframe1.note) #numpy ile ortalama bulma
print(ortlama_np)

17680.0
17680.0

In [103]:
dataframe1.dropna(inplace=True) #dropna ile NaN değerleri sildik 
dataframe1

      name   age     note  yeni_future  bool
0      ali  12.0    123.0            1  True
1     veli  34.0    456.0            2  True
2  zübeyde  56.0     78.0            3  True
3    ahmet  78.0  87654.0            4  True
5      can  12.0     89.0            6  True

In [104]:
print(dataframe1.note.mean()) #ortalama not hesabı
#ortalamaya bakarak üstünde vya altında olduğunu yazdırma
dataframe1["ortalama"]= ["ortalamanın altında" if dataframe1.note.mean()>each else "ortalamanın üstünde" for each in dataframe1.note]
dataframe1

17680.0

      name   age     note  yeni_future  bool             ortalama
0      ali  12.0    123.0            1  True  ortalamanın altında
1     veli  34.0    456.0            2  True  ortalamanın altında
2  zübeyde  56.0     78.0            3  True  ortalamanın altında
3    ahmet  78.0  87654.0            4  True  ortalamanın üstünde
5      can  12.0     89.0            6  True  ortalamanın altında

In [105]:
dataframe1.columns = [each.upper() for each in dataframe1.columns]
dataframe1.columns

Index(['NAME', 'AGE', 'NOTE', 'YENI_FUTURE', 'BOOL', 'ORTALAMA'], dtype='object')

In [106]:
dataframe1["yeni2_future"]=[1,1,1,1,1]
dataframe1.columns = [each.split('_')[0]+" "+each.split('_')[1] if len(each.split('_'))>1 else each for each in dataframe1.columns]
dataframe1

,NAME,AGE,NOTE,YENI FUTURE,BOOL,ORTALAMA,yeni2 future
0,ali,12.0,123.0,1,True,ortalamanın altında,1
1,veli,34.0,456.0,2,True,ortalamanın altında,1
2,zübeyde,56.0,78.0,3,True,ortalamanın altında,1
3,ahmet,78.0,87654.0,4,True,ortalamanın üstünde,1
5,can,12.0,89.0,6,True,ortalamanın altında,1

In [107]:
dataframe1.columns = [ each.split(" ")[0]+"_"+each.split(" ")[1] if len(each.split(" "))>1 else each for each in dataframe1.columns]
dataframe1

,NAME,AGE,NOTE,YENI_FUTURE,BOOL,ORTALAMA,yeni2_future
0,ali,12.0,123.0,1,True,ortalamanın altında,1
1,veli,34.0,456.0,2,True,ortalamanın altında,1
2,zübeyde,56.0,78.0,3,True,ortalamanın altında,1
3,ahmet,78.0,87654.0,4,True,ortalamanın üstünde,1
5,can,12.0,89.0,6,True,ortalamanın altında,1

## Concatenating Data

In [108]:
dataframe1.drop(["yeni2_future","YENI_FUTURE"],axis=1,inplace=True)
dataframe1

      NAME   AGE     NOTE  BOOL             ORTALAMA
0      ali  12.0    123.0  True  ortalamanın altında
1     veli  34.0    456.0  True  ortalamanın altında
2  zübeyde  56.0     78.0  True  ortalamanın altında
3    ahmet  78.0  87654.0  True  ortalamanın üstünde
5      can  12.0     89.0  True  ortalamanın altında

In [109]:
#verticle(dikey) birleştirme  #concat() metodu ile iki dataframe'i birleştirdik
data1 = dataframe1.head()     
data2 = dataframe1.tail()
data_concat = pd.concat([data1,data2],axis=0)
data_concat

      NAME   AGE     NOTE  BOOL             ORTALAMA
0      ali  12.0    123.0  True  ortalamanın altında
1     veli  34.0    456.0  True  ortalamanın altında
2  zübeyde  56.0     78.0  True  ortalamanın altında
3    ahmet  78.0  87654.0  True  ortalamanın üstünde
5      can  12.0     89.0  True  ortalamanın altında
0      ali  12.0    123.0  True  ortalamanın altında
1     veli  34.0    456.0  True  ortalamanın altında
2  zübeyde  56.0     78.0  True  ortalamanın altında
3    ahmet  78.0  87654.0  True  ortalamanın üstünde
5      can  12.0     89.0  True  ortalamanın altında

In [110]:
#horizontal(yatay) birleştirme
data_contact2 = pd.concat([data1,data2],axis=1) #axis= 1 yazarak stunları birleştirdik
data_contact2

,NAME,AGE,NOTE,BOOL,ORTALAMA,NAME,AGE,NOTE,BOOL,ORTALAMA
0,ali,12.0,123.0,True,ortalamanın altında,ali,12.0,123.0,True,ortalamanın altında
1,veli,34.0,456.0,True,ortalamanın altında,veli,34.0,456.0,True,ortalamanın altında
2,zübeyde,56.0,78.0,True,ortalamanın altında,zübeyde,56.0,78.0,True,ortalamanın altında
3,ahmet,78.0,87654.0,True,ortalamanın üstünde,ahmet,78.0,87654.0,True,ortalamanın üstünde
5,can,12.0,89.0,True,ortalamanın altında,can,12.0,89.0,True,ortalamanın altında

# Transforming Data

In [111]:
dataframe1["buyuk_yas"] = [each*2 for each in dataframe1.AGE]
dataframe1

      NAME   AGE     NOTE  BOOL             ORTALAMA  buyuk_yas
0      ali  12.0    123.0  True  ortalamanın altında       24.0
1     veli  34.0    456.0  True  ortalamanın altında       68.0
2  zübeyde  56.0     78.0  True  ortalamanın altında      112.0
3    ahmet  78.0  87654.0  True  ortalamanın üstünde      156.0
5      can  12.0     89.0  True  ortalamanın altında       24.0

In [112]:
def mlt(yas):
    return yas*2
dataframe1["apply_metodu"] = dataframe1.AGE.apply(mlt)
dataframe1

      NAME   AGE     NOTE  BOOL             ORTALAMA  buyuk_yas  apply_metodu
0      ali  12.0    123.0  True  ortalamanın altında       24.0          24.0
1     veli  34.0    456.0  True  ortalamanın altında       68.0          68.0
2  zübeyde  56.0     78.0  True  ortalamanın altında      112.0         112.0
3    ahmet  78.0  87654.0  True  ortalamanın üstünde      156.0         156.0
5      can  12.0     89.0  True  ortalamanın altında       24.0          24.0